MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.h
/** @defgroup I2C_Error_Codes I2C Error Codes
  * @{
  */
#define  HAL_I2C_ERROR_NONE  (0UL)      /*!< No error                      */
#define  HAL_I2C_ERROR_BERR  (1UL << 0) /*!< Bus error                     */
#define  HAL_I2C_ERROR_ARLO  (1UL << 1) /*!< Arbitration lost              */
#define  HAL_I2C_ERROR_AF    (1UL << 2) /*!< Acknowledge not received      */
#define  HAL_I2C_ERROR_OVR   (1UL << 3) /*!< Overrun/Underrun (slave mode) */
#define  HAL_I2C_ERROR_SIZE  (1UL << 4) /*!< Size management error         */
#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
#define  HAL_I2C_ERROR_DMA   (1UL << 5) /*!< DMA transfer error            */
#endif /* USE_HAL_I2C_DMA */
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup I2C_Exported_Functions HAL I2C Functions
  * @{
  */

/** @defgroup I2C_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */
hal_status_t HAL_I2C_Init(hal_i2c_handle_t *hi2c, hal_i2c_t instance);
void HAL_I2C_DeInit(hal_i2c_handle_t *hi2c);
/**
  * @}
  */

/** @defgroup I2C_Exported_Functions_Group2 Configuration functions
  * @{
  */
/* Global configuration */
hal_status_t HAL_I2C_SetConfig(hal_i2c_handle_t *hi2c, const hal_i2c_config_t *p_config);
void HAL_I2C_GetConfig(const hal_i2c_handle_t *hi2c, hal_i2c_config_t *p_config);
hal_status_t HAL_I2C_SetTiming(hal_i2c_handle_t *hi2c, uint32_t value);
uint32_t HAL_I2C_GetTiming(const hal_i2c_handle_t *hi2c);

/* Filter */
hal_status_t HAL_I2C_EnableAnalogFilter(hal_i2c_handle_t *hi2c);
hal_status_t HAL_I2C_DisableAnalogFilter(hal_i2c_handle_t *hi2c);
hal_i2c_analog_filter_status_t HAL_I2C_IsEnabledAnalogFilter(const hal_i2c_handle_t *hi2c);
hal_status_t HAL_I2C_SetDigitalFilter(hal_i2c_handle_t *hi2c, uint32_t noise_filtering_in_bus_clk_period);
uint32_t HAL_I2C_GetDigitalFilter(const hal_i2c_handle_t *hi2c);

/* Wakeup from Stop mode(s) */
hal_status_t HAL_I2C_SLAVE_EnableWakeUp(hal_i2c_handle_t *hi2c);
hal_status_t HAL_I2C_SLAVE_DisableWakeUp(hal_i2c_handle_t *hi2c);
hal_i2c_slave_wake_up_status_t HAL_I2C_SLAVE_IsEnabledWakeUp(const hal_i2c_handle_t *hi2c);

/* Fast mode plus driving capability */
hal_status_t HAL_I2C_EnableFastModePlus(hal_i2c_handle_t *hi2c);
hal_status_t HAL_I2C_DisableFastModePlus(hal_i2c_handle_t *hi2c);
hal_i2c_fast_mode_plus_status_t HAL_I2C_IsEnabledFastModePlus(const hal_i2c_handle_t *hi2c);

/* Clock stretching */
hal_status_t HAL_I2C_SLAVE_EnableClockStretching(hal_i2c_handle_t *hi2c);
hal_status_t HAL_I2C_SLAVE_DisableClockStretching(hal_i2c_handle_t *hi2c);
hal_i2c_slave_stretch_mode_status_t HAL_I2C_SLAVE_IsEnabledClockStretching(const hal_i2c_handle_t *hi2c);

/* Acknowledge General Call */
hal_status_t HAL_I2C_SLAVE_EnableAckGeneralCall(hal_i2c_handle_t *hi2c);
hal_status_t HAL_I2C_SLAVE_DisableAckGeneralCall(hal_i2c_handle_t *hi2c);
hal_i2c_slave_ack_general_call_status_t HAL_I2C_SLAVE_IsEnabledAckGeneralCall(const hal_i2c_handle_t *hi2c);

/* Own Address 2 */
hal_status_t HAL_I2C_SetConfigOwnAddress2(hal_i2c_handle_t *hi2c, uint32_t addr, hal_i2c_own_addr2_mask_t mask);
void HAL_I2C_GetConfigOwnAddress2(const hal_i2c_handle_t *hi2c, uint32_t *addr, hal_i2c_own_addr2_mask_t *mask);
hal_status_t HAL_I2C_EnableOwnAddress2(hal_i2c_handle_t *hi2c);
hal_status_t HAL_I2C_DisableOwnAddress2(hal_i2c_handle_t *hi2c);
hal_i2c_own_addr2_status_t HAL_I2C_IsEnabledOwnAddress2(const hal_i2c_handle_t *hi2c);

#if defined (USE_HAL_I2C_REGISTER_CALLBACKS) && (USE_HAL_I2C_REGISTER_CALLBACKS == 1U)
/* Register callbacks */
hal_status_t HAL_I2C_MASTER_RegisterTxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback);
hal_status_t HAL_I2C_MASTER_RegisterRxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback);
hal_status_t HAL_I2C_MASTER_RegisterMemTxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback);
hal_status_t HAL_I2C_MASTER_RegisterMemRxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback);
hal_status_t HAL_I2C_SLAVE_RegisterTxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback);
hal_status_t HAL_I2C_SLAVE_RegisterRxCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback);
hal_status_t HAL_I2C_SLAVE_RegisterListenCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback);
hal_status_t HAL_I2C_SLAVE_RegisterAddrMatchCallback(hal_i2c_handle_t *hi2c, hal_i2c_slave_addr_cb_t p_callback);
hal_status_t HAL_I2C_RegisterAbortCpltCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback);
hal_status_t HAL_I2C_RegisterErrorCallback(hal_i2c_handle_t *hi2c, hal_i2c_cb_t p_callback);
#endif /* USE_HAL_I2C_REGISTER_CALLBACKS */

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
hal_status_t HAL_I2C_SetTxDMA(hal_i2c_handle_t *hi2c, hal_dma_handle_t *hdma);
hal_status_t HAL_I2C_SetRxDMA(hal_i2c_handle_t *hi2c, hal_dma_handle_t *hdma);
#endif /* USE_HAL_I2C_DMA */
/**
  * @}
  */

/** @defgroup I2C_Exported_Functions_Group3 Input and Output operation functions
  * @{
  */
/* Blocking mode: Polling */
hal_status_t HAL_I2C_MASTER_Transmit(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                     uint32_t size_byte, uint32_t timeout_ms);
hal_status_t HAL_I2C_MASTER_Receive(hal_i2c_handle_t *hi2c, uint32_t device_addr, void *p_data,
                                    uint32_t size_byte, uint32_t timeout_ms);
hal_status_t HAL_I2C_MASTER_MemWrite(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t memory_addr,
                                     hal_i2c_mem_addr_size_t memory_addr_size, const void *p_data,
                                     uint32_t size_byte, uint32_t timeout_ms);
hal_status_t HAL_I2C_MASTER_MemRead(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t memory_addr,
                                    hal_i2c_mem_addr_size_t memory_addr_size, void *p_data, uint32_t size_byte,
                                    uint32_t timeout_ms);
hal_status_t HAL_I2C_MASTER_PollForSlaveReady(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t timeout_ms);
hal_status_t HAL_I2C_SLAVE_Transmit(hal_i2c_handle_t *hi2c, const void *p_data,
                                    uint32_t size_byte, uint32_t timeout_ms);
hal_status_t HAL_I2C_SLAVE_Receive(hal_i2c_handle_t *hi2c, void *p_data,
                                   uint32_t size_byte, uint32_t timeout_ms);
/* Non-Blocking mode: Interrupt */
hal_status_t HAL_I2C_MASTER_Transmit_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                        uint32_t size_byte);
hal_status_t HAL_I2C_MASTER_Receive_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr, void *p_data,
                                       uint32_t size_byte);
hal_status_t HAL_I2C_MASTER_MemWrite_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t memory_addr,
                                        hal_i2c_mem_addr_size_t memory_addr_size, const void *p_data,
                                        uint32_t size_byte);
hal_status_t HAL_I2C_MASTER_MemRead_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t memory_addr,
                                       hal_i2c_mem_addr_size_t memory_addr_size, void *p_data, uint32_t size_byte);
hal_status_t HAL_I2C_MASTER_SEQ_Transmit_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                            uint32_t size_byte, hal_i2c_xfer_opt_t xfer_opt);
hal_status_t HAL_I2C_MASTER_SEQ_Receive_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr, void *p_data,
                                           uint32_t size_byte, hal_i2c_xfer_opt_t xfer_opt);
hal_status_t HAL_I2C_MASTER_Abort_IT(hal_i2c_handle_t *hi2c, uint32_t device_addr);
hal_status_t HAL_I2C_SLAVE_Transmit_IT(hal_i2c_handle_t *hi2c, const void *p_data, uint32_t size_byte);
hal_status_t HAL_I2C_SLAVE_Receive_IT(hal_i2c_handle_t *hi2c, void *p_data, uint32_t size_byte);
hal_status_t HAL_I2C_SLAVE_SEQ_Transmit_IT(hal_i2c_handle_t *hi2c, const void *p_data, uint32_t size_byte,
                                           hal_i2c_xfer_opt_t xfer_opt);
hal_status_t HAL_I2C_SLAVE_SEQ_Receive_IT(hal_i2c_handle_t *hi2c, void *p_data, uint32_t size_byte,
                                          hal_i2c_xfer_opt_t xfer_opt);
hal_status_t HAL_I2C_SLAVE_EnableListen_IT(hal_i2c_handle_t *hi2c);
hal_status_t HAL_I2C_SLAVE_DisableListen_IT(hal_i2c_handle_t *hi2c);
hal_status_t HAL_I2C_SLAVE_Abort_IT(hal_i2c_handle_t *hi2c);

#if defined (USE_HAL_I2C_DMA) && (USE_HAL_I2C_DMA == 1)
/* Non-Blocking mode: DMA */
hal_status_t HAL_I2C_MASTER_Transmit_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                         uint32_t size_byte);
hal_status_t HAL_I2C_MASTER_Receive_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, void *p_data,
                                        uint32_t size_byte);
hal_status_t HAL_I2C_MASTER_MemWrite_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t memory_addr,
                                         hal_i2c_mem_addr_size_t memory_addr_size, const void *p_data,
                                         uint32_t size_byte);
hal_status_t HAL_I2C_MASTER_MemRead_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, uint32_t memory_addr,
                                        hal_i2c_mem_addr_size_t memory_addr_size, void *p_data, uint32_t size_byte);
hal_status_t HAL_I2C_MASTER_SEQ_Transmit_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, const void *p_data,
                                             uint32_t size_byte, hal_i2c_xfer_opt_t xfer_opt);
hal_status_t HAL_I2C_MASTER_SEQ_Receive_DMA(hal_i2c_handle_t *hi2c, uint32_t device_addr, void *p_data,
                                            uint32_t size_byte, hal_i2c_xfer_opt_t xfer_opt);
hal_status_t HAL_I2C_SLAVE_Transmit_DMA(hal_i2c_handle_t *hi2c, const void *p_data, uint32_t size_byte);
hal_status_t HAL_I2C_SLAVE_Receive_DMA(hal_i2c_handle_t *hi2c, void *p_data, uint32_t size_byte);
hal_status_t HAL_I2C_SLAVE_SEQ_Transmit_DMA(hal_i2c_handle_t *hi2c, const void *p_data, uint32_t size_byte,
                                            hal_i2c_xfer_opt_t xfer_opt);
hal_status_t HAL_I2C_SLAVE_SEQ_Receive_DMA(hal_i2c_handle_t *hi2c, void *p_data, uint32_t size_byte,
                                           hal_i2c_xfer_opt_t xfer_opt);
#endif /* USE_HAL_I2C_DMA */
/**
  * @}
  */

