MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_i2c.h
/** @defgroup I2C_Exported_Functions_Group4 IRQ Handlers
  * @{
  */
void HAL_I2C_EV_IRQHandler(hal_i2c_handle_t *hi2c);
void HAL_I2C_ERR_IRQHandler(hal_i2c_handle_t *hi2c);
/**
  * @}
  */

/** @defgroup I2C_Exported_Functions_Group5 Weak Callback Functions
  * @{
  */
void HAL_I2C_MASTER_TxCpltCallback(hal_i2c_handle_t *hi2c);
void HAL_I2C_MASTER_RxCpltCallback(hal_i2c_handle_t *hi2c);
void HAL_I2C_MASTER_MemTxCpltCallback(hal_i2c_handle_t *hi2c);
void HAL_I2C_MASTER_MemRxCpltCallback(hal_i2c_handle_t *hi2c);
void HAL_I2C_SLAVE_TxCpltCallback(hal_i2c_handle_t *hi2c);
void HAL_I2C_SLAVE_RxCpltCallback(hal_i2c_handle_t *hi2c);
void HAL_I2C_SLAVE_AddrCallback(hal_i2c_handle_t *hi2c, hal_i2c_slave_xfer_direction_t xfer_direction,
                                uint32_t addr_match_code);
void HAL_I2C_SLAVE_ListenCpltCallback(hal_i2c_handle_t *hi2c);
void HAL_I2C_ErrorCallback(hal_i2c_handle_t *hi2c);
void HAL_I2C_AbortCpltCallback(hal_i2c_handle_t *hi2c);
/**
  * @}
  */

/** @defgroup I2C_Exported_Functions_Group6 Peripheral State, Mode and Error functions, Kernel Clock Frequency
  * @{
  */
hal_i2c_state_t HAL_I2C_GetState(const hal_i2c_handle_t *hi2c);
hal_i2c_mode_t HAL_I2C_GetMode(const hal_i2c_handle_t *hi2c);
#if defined (USE_HAL_I2C_GET_LAST_ERRORS) && (USE_HAL_I2C_GET_LAST_ERRORS == 1)
uint32_t HAL_I2C_GetLastErrorCodes(const hal_i2c_handle_t *hi2c);
#endif /* USE_HAL_I2C_GET_LAST_ERRORS */
uint32_t HAL_I2C_GetClockFreq(const hal_i2c_handle_t *hi2c);
/**
  * @}
  */

#if defined(USE_HAL_MUTEX) && (USE_HAL_MUTEX == 1)
/** @defgroup I2C_Exported_Functions_Group7 Acquire/Release/Free the bus
  * @{
  */
hal_status_t HAL_I2C_AcquireBus(hal_i2c_handle_t *hi2c, uint32_t timeout_ms);
hal_status_t HAL_I2C_ReleaseBus(hal_i2c_handle_t *hi2c);
/**
  * @}
  */
#endif /* USE_HAL_MUTEX */

#if defined (USE_HAL_I2C_USER_DATA) && (USE_HAL_I2C_USER_DATA == 1)
/** @defgroup I2C_Exported_Functions_Group8 Set/Get user data
  * @{
  */
void HAL_I2C_SetUserData(hal_i2c_handle_t *hi2c, const void *p_user_data);
const void *HAL_I2C_GetUserData(const hal_i2c_handle_t *hi2c);
/**
  * @}
  */
#endif /* USE_HAL_I2C_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */

#endif /* I2C1 || I2C2 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_HAL_I2C_H */
